$("#sideBtn").hide();
$(window).scroll(function () {
    let scrollTop = $(this).scrollTop();
    console.log(scrollTop);
    if (scrollTop > 150) {
        $("#sideBtn").fadeIn(800);
    }
    else {
        $("#sideBtn").fadeOut(500);
    }
});
$("#sideBtn").click(function () {
    $("body , html").animate({
        scrollTop: 0
    }, 300);
});

// ---------------------append----------------------
$(function () {
    var productArray = [{
        category: "brewing grains",
        img: "images/pro1.png",
        h3: "喬伊農場奇亞籽",
        h4: "成分：奇亞籽<br>重量：330g<br>保存期限：2年<br>保存方式：放置於陰涼處<br>產地：玻利維亞<br>進口總代理商：德和貿易有限公司<br>地址：高雄市鳳山區鳳甲路519號3樓<br>電話：07-7926015<br>使用方式：每日1~3次，每次10公克，搭配300CC水；亦可加於飲品、粥品、飯食中。浸泡5~20分鐘以上，溫度不可高於50度。<br>營養價值：富含膳食纖維、OMEGA3、抗氧化指數9800、鈣含量為牛奶5倍、鐵含量是菠菜3倍、維生素C是橘子7倍、含有20種完整胺基酸。"
    },
    {
        category: "oil",
        img: "images/pro2.png",
        h3: "紫蘇籽油",
        h4: "成分：紫蘇籽果實<br>容量：250ml<br>保存期限：未開封1年<br>保存方式：放置於陰涼處<br>產地：台灣<br>製造商：金椿茶油工坊有限公司<br>地址：苗栗縣三灣鄉永和村三鄰石馬店18-3號<br>電話：037-831195<br>使用方式：生飲，每次10ml；低溫涼拌。<br>營養價值：富含膳食纖維、OMEGA3、抗氧化指數9800、鈣含量為牛奶5倍、鐵含量是菠菜3倍、維生素C是橘子7倍、含有20種完整胺基酸。"
    },
    {
        category: "selfMade",
        img: "images/pro3.png",
        h3: "週週現磨黑芝麻醬",
        h4: "成分：黑芝麻<br>容量：300g(亦可自帶容器零買)<br>保存期限：三個月<br>保存方式：放置於陰涼處<br>產地：台灣<br>懶人樹天然健康の店<br>地址：台中市潭子區潭興路三段80號<br>電話：0988248407<br>使用方式：抹吐司、饅頭；製作拌醬(可拌麵、飯、菜)；加入熱飲中(如豆漿、牛奶或穀粉)。<br>營養價值：含豐富多元及單元不飽和脂肪酸(>85%)，且主要為亞麻油酸(人體必需脂肪酸)；含豐富膳食纖維、蛋白質、維生素B群、維生素E、鐵、鎂、鉀、鋅及多種微量元素。"
    },
    {
        category: "oil",
        img: "images/pro4.png",
        h3: "Agro農場特級冷壓初榨橄欖油",
        h4: "成分：100%冷壓初榨橄欖油<br>容量：750ml<br>保存期限：一年<br>保存方式：放置於陰涼處<br>產地：義大利<br>進口商：珍鈺蓁食品行<br>地址：台中市潭子區潭陽路25號<br>電話：04-25393399<br>使用方式：生飲、涼拌、煎、煮、炒。<br>營養價值：含豐富多元不飽和脂肪酸、維生素E、抗氧多酚。<br>特色：農場原裝進口，空運來台。"
    },
    {
        category: "oil",
        img: "images/pro5.png",
        h3: "手工純釀醬油",
        h4: "成分：水、小麥、黃豆(非基因改造)、蔗糖、湖鹽、麥芽糖、糖蜜。<br>容量：400ml<br>保存期限：2年<br>保存方式：開封後請冷藏<br>產地：台灣<br>製造商：有幾園生物科技公司<br>地址：台中市梧棲區港埠路一段537號<br>電話：04-26399889<br>特色：直火工法烘焙，超過210天熟成，完整製麴，比一般製程多一倍時間，口感更甘醇。"
    },
    {
        category: "condiment",
        img: "images/pro6.png",
        h3: "苦茶油薑泥拌醬",
        h4: "成分：薑、連淨苦茶油、葵花油、純黑麻油、植物性調味粉(海鹽、葡萄糖、醬油粉、歐芹粉、百里香粉、香草粉、大豆酵素)、鹽、抗氧化劑(維生素E)。<br>容量：210g<br>保存期限：18個月<br>保存方式：開封後請冷藏<br>產地：台灣<br>製造商：連淨綠色科技股份有限公司<br>地址：台北市新店區寶興路45巷9弄2號1樓<br>電話：0800-585-598<br>使用方式：產品為12倍濃縮醬，建議以個人喜好兌水稀釋調和後，炒菜、拌麵、拌飯或作為湯底。<br>特色：使用來自原生態產區優質苦茶油"
    },
    {
        category: "etc",
        img: "images/pro7.png",
        h3: "野放茶植物保健牙膏",
        h4: "成分：高山有機野放茶、左手香、薄荷、甘草、甜菊、海鹽、海藻膠、木醣醇、天然方解石。<br>容量：100g<br>保存期限：2年<br>產地：台灣<br>製造商：華紐實業有限公司<br>使用方式：用溫水依正確刷牙方式兼漱口30秒以上，牙齦流血或口腔潰瘍者，起延長漱口時間。<br>特色：使用高山有機野放茶+天然抑菌香草精華，所有原料均為食品等級以上嚴選。"
    },
    {
        category: "grains",
        img: "images/pro8.png",
        h3: "台灣紅寶紅豆",
        h4: "成分：紅豆<br>重量：400g<br>保存期限：一年<br>保存方式：開封後請盡速食用完畢或置於冰箱冷藏保存<br>產地：台灣<br>製造商：諸成實業有限公司<br>地址：高雄市仁武區成功路127-67號B棟<br>電話：07-3757277<br>特色：堅持台灣本地栽種"
    },
    {
        category: "grains",
        img: "images/pro9.png",
        h3: "有機100%無糖黑麥脆麵包-歐式原味",
        h4: "成分：有機小麥麵粉(台灣)、有機黑麥粉(芬蘭)、有機冷壓橄欖油(西班牙)、有機白芝麻(玻利維亞)、有機黑芝麻(玻利維亞)、葛縷子、茴香、鹽、酵母、有機白胡椒粉(斯里蘭卡)。<br>重量：70g±5%<br>保存期限：未開封12個月<br>保存方式：開封後請盡速食用完<br>製造商：安芯食品社會企業有限公司<br>地址：桃園市蘆竹區南崁路一段99號7樓之5<br>電話：03-3520311<br>驗證機構：采園生態驗證有限公司<br>特色：單純成分、極簡加工，嚴守有機規範，選用台灣在地或公平貿易的有機原料；社會企業，您的消費將成為弱勢者工作的機會，且提供固定比例盈餘回饋社會。"
    },
    {
        category: "brewing",
        img: "images/pro10.png",
        h3: "老薑紅茶",
        h4: "成分：紅茶、老薑<br>重量：40g(4g*10入)<br>保存期限：24個月<br>保存方式：放置於陰涼處，避免陽光直射。<br>產地：台灣<br>製造商：阿華師茶業股份有限公司<br>地址：台中市大里區中投西路三段409巷2號<br>電話：0800-824-888<br>使用方式：將茶包放入450cc98度熱水中，浸泡5~6分鐘。<br>營養價值：驅寒、去濕、暖身、促進新陳代謝。"
    },
    {
        category: "grains",
        img: "images/pro11.png",
        h3: "鴨間稻有機十全珍穀",
        h4: "成分：有機糙米(台灣)、有機小麥(澳洲)、有機圓糯、糙米(台灣)、有機燕麥(澳洲)、有機黑糯糙米(台灣)、有機珍珠大麥(芬蘭)、有機蕎麥(美國)、有機黑麥(芬蘭)、有機紅扁豆(土耳其)、有機黑豆(中國)、有機紅豆(巴西)、有機埃及豆(土耳其)、有機小米(美國)。<br>重量：900g<br>保存期限：9個月<br>保存方式：勿放置於地上或溫差較大的地方，並避免日光直曬；建議開封後冷藏。<br>產地：台灣<br>製造商：泉順食品企業股份有限公司<br>地址：苗栗縣苑裡鎮玉田里7鄰玉田91-1號<br>電話：037-743616<br>使用方式：洗淨後，加入1.6倍的水，放進電鍋煮熟後，再悶10分鐘。<br>營養價值：十三種穀物滿足營養需求，全有機，免浸泡。"
    },
    {
        category: "brewing",
        img: "images/pro12.png",
        h3: "杏仁粉(無糖)",
        h4: "成分：原豆杏仁<br>重量：500g<br>保存期限：2年<br>保存方式：開封後密封存放於陰涼處，冷藏尤佳。<br>產地：台灣<br>製造商：雄霸生物科技有限公司<br>地址：桃園市桃園區興華路13-1號<br>電話：03-3648988<br>使用方式：按個人喜好沖泡熱水，亦可添加於牛奶、豆漿、穀粉一起飲用。<br>營養價值：含豐富脂肪、黃酮類及多酚類成分；本草綱目記載其有「止咳平喘、潤腸通便」功效。<br>"
    },
    {
        category: "brewing",
        img: "images/pro13.png",
        h3: "山藥四神粉",
        h4: "成分：薏仁、淮山、大豆、糙米、當歸、茯苓、芡實、蓮子。<br>重量：500g<br>保存期限：2年<br>保存方式：開封後密封存放於陰涼處，冷藏尤佳<br>產地：台灣<br>製造商：雄霸生物科技有限公司<br>地址：桃園市桃園區興華路13-1號<br>電話：03-3648988<br>使用方式：少許冷水調勻至糊狀，再直接沖調熱水即可飲用。<br>營養價值：溫脾、健胃、補腎、利濕。"
    },
    {
        category: "brewing grains",
        img: "images/pro14.png",
        h3: "黑芝麻粉",
        h4: "成分：精選黑芝麻<br>重量：420g<br>保存期限：2年<br>保存方式：開封後密封存放於陰涼處，冷藏尤佳。<br>產地：台灣<br>製造商：雄霸生物科技有限公司<br>地址：桃園市桃園區興華路13-1號<br>電話：03-3648988<br>使用方式：按個人喜好沖泡熱水，亦可添加於牛奶、豆漿、穀粉一起飲用。<br>營養價值：含豐富多元及單元不飽和脂肪酸(>85%)，且主要為亞麻油酸(人體必需脂肪酸)；含豐富膳食纖維、蛋白質、維生素B群、維生素E、鐵、鎂、鉀、鋅及多種微量元素。"
    }
    ];
    var productCount = productArray.length;

    // if($("body").width() < 420 ) {
    // for (let $i = 0; $i < productCount; $i++) {
    //     $(".product").append(
    //         `<div class="proc_wrap ${productArray[$i].category}">
    //             <div class="card">
    //                 <a href="#pro${[$i]}" rel="modal:open"><img src="${productArray[$i].img}" alt=""></a>
    //                     <div id="pro${[$i]}" class="modal ">
    //                         <h3>${productArray[$i].h3}</h3>
    //                         <h4>${productArray[$i].h4}</h4>
    //                         <a href="#" rel="modal:close">Close</a>
    //                     </div>
    //             </div>
    //         </div>`
    //     );
    // } }else {

    for (let $i = 0; $i < productCount; $i++) {
        $(".product").append(
            `<div class="proc_wrap ${productArray[$i].category}">
        <div class="card">
            <img src="${productArray[$i].img}" alt="">
            <div class="back flex">
                <h3>${productArray[$i].h3}</h3>
                <div class="inside flex"><a href="#pro${[$i]}" rel="modal:open">了解更多</a></div>
                <div id="pro${[$i]}" class="modal ">
                    <h3>${productArray[$i].h3}</h3>
                    <h4>${productArray[$i].h4}</h4>
                    <a href="#" rel="modal:close">Close</a>
                </div>
            </div>
        </div>
    </div>`
        );
    };
    // }
})

// -----------------------filter-----------------------------
$(".listCheck").click(function () {
    $(this).attr("id", "effect").siblings().removeAttr("id")
    let listType = $(this).attr("data-list");
    console.log(listType);
    $(".proc_wrap").fadeOut(500);
    $(listType).fadeIn(500);
    if (listType == "all") {
        $(".proc_wrap").fadeIn(500);
    }
});

